## kosullu eleman islemleri

In [1]:
import numpy as np
import pandas as pd

m = np.random.randint(1, 30, size=(10, 3))
df = pd.DataFrame(m, columns=["var1", "var2", "var3"])
df

   var1  var2  var3
0    14    27    22
1     6    14    15
2    13    16     1
3    28    18    22
4    21     8    15
5    13    22     9
6     7     1    18
7     7    26    26
8    23    10    23
9    13    29     4

In [2]:
df["var1"]

0    14
1     6
2    13
3    28
4    21
5    13
6     7
7     7
8    23
9    13
Name: var1, dtype: int32

In [3]:
df["var1"][0:2]

0    14
1     6
Name: var1, dtype: int32

In [4]:
df[0:2]

   var1  var2  var3
0    14    27    22
1     6    14    15

In [5]:
df[0:2][["var1", "var2"]]

# fancy index ile eri≈üilebilir

   var1  var2
0    14    27
1     6    14

In [6]:
df

# 1. deƒüi≈ükendeki deƒüerlerin 15'ten b√ºy√ºk olup olmadƒ±ƒüƒ±nƒ± g√∂zlemleme

   var1  var2  var3
0    14    27    22
1     6    14    15
2    13    16     1
3    28    18    22
4    21     8    15
5    13    22     9
6     7     1    18
7     7    26    26
8    23    10    23
9    13    29     4

In [7]:
df.var1

0    14
1     6
2    13
3    28
4    21
5    13
6     7
7     7
8    23
9    13
Name: var1, dtype: int32

In [8]:
df[df.var1 > 15]

# var1 isimli deƒüi≈ükende sadece 15'ten b√ºy√ºk olanlarƒ± getirdi

   var1  var2  var3
3    28    18    22
4    21     8    15
8    23    10    23

In [9]:
df[df.var1 > 15]["var2"]

# yukarƒ±da getirilmi≈ü olan bilgiden sadece "var2" s√ºtununu filtreler

3    18
4     8
8    10
Name: var2, dtype: int32

In [10]:
df[(df.var1 > 15) & (df.var3 < 10)]

# bu ≈üekildeki kullanƒ±mda, aynƒ± anda var1 s√ºtununda 15'ten b√ºy√ºk ve var3 s√ºtununda 10dan k√º√ß√ºk olan deƒüerleri filtreler

Empty DataFrame
Columns: [var1, var2, var3]
Index: []

In [11]:
df.loc[(df.var1 > 15), ["var1", "var2"]]

# loc se√ßim

   var1  var2
3    28    18
4    21     8
8    23    10

In [12]:
df[(df.var1 > 15)][["var1", "var2"]]

# iloc se√ßim

   var1  var2
3    28    18
4    21     8
8    23    10